{   
    "options": {
        "output-html": "../../build/base/thomas-flanigan.html"
    },
    "resume": {
        "contact": {
            "name": "Thomas Flanigan",
            "nickname": "Tom",
            "email": "tom@thomasflanigan.com",
            "phone": "(617) 785-5442",
            "location": {
                "city": "Austin",
                "state": "TX",
                "country": "United States"
            }
        },
        "introduction": {
            "job": "Senior DevOps and AppSec Engineer",
            "summary": "An accomplished DevOps engineer with over ten years of experience, I have a strong foundation in application development enhanced by a robust skill set in application security. I am passionate about leading initiatives that drive team efficiency and project success. By implementing cutting-edge solutions and automating workflows, I significantly optimize processes and improve security postures. My commitment to professional development and team mentorship fosters a collaborative workplace where innovative solutions thrive.",
            "website": "https://thomasflanigan.com/",
            "social": "https://www.linkedin.com/in/thomas-flanigan/"
        },
        "skills": [
            {
                "category": "Core Technical Skills",
                "details": ["Python", "Jenkins", "Git", "SVN", "SDLC Automation"]
            },
            {
                "category": "Cloud & DevOps",
                "details": ["Google Cloud Platform", "Azure", "Docker & Containers", "Kubernetes", "Terraform"]
            },
            {
                "category": "Project Management",
                "details": ["Jira & Atlassian", "Trello", "Agile Methodologies", "Scrum Master", "CI/CD Pipelines"]
            },
            {
                "category": "Programming & Scripting",
                "details": ["Python", "Java", "HTML & CSS", "JS & TS", "SQL & noSQL"]
            },
            {
                "category": "Security & Testing",
                "details": ["Supply Chain Security", "Pen Testing Tools", "Automated Testing", "Threat Modeling"]
            },
            {
                "category": "Emerging Tech",
                "details": ["Finetuning (Image Classification)", "Prompt Engineering", "LangChain"]
            }
        ],
        "experiences": [
            {
                "organization": "Texas Farm Bureau Insurance",
                "title": "Applications Cyber Security Engineer (Contractor, through Dogwood Management Partners LLC)",
                "start_date": "03/27/2023",
                "end_date": "09/27/2023",
                "website": "https://www.txfb-ins.com/",
                "description": "Directed the implementation of shift-left security strategies, significantly improving automation and proactive vulnerability management across critical projects.",
                "highlights": [
                    "Led a team of developers in implementing a comprehensive roadmap and coding standards, which significantly accelerated the adoption of modern best-practices and integration with cloud services.",
                    "Developed and integrated a Software Bill of Materials automation process using OWASP-CycloneDX, enhancing security compliance for all Python projects.",
                    "Transitioned technical documentation to a Docs as Code approach using Azure DevOps, streamlining updates and collaboration.",
                    "Formalized meeting expectations, including the use of agendas, eliminating ~50 hours in wasted meeting time per sprint.",
                    "Engineered a cloud-based solution to automate the transformation of vulnerability scan outputs into actionable Azure DevOps tickets, eliminating ~30 hours per sprint of manual management.",
                    "Enhanced Maven pipelines with OWASP Dependency-Check automation, bolstering security measures for Java projects.",
                    "Provided strategic guidance as a technical advisor on managed cloud services, influencing key decisions on system architectures and workload optimizations."
                ]
            },
            {
                "organization": "MEDITECH",
                "title": "Senior Software Developer",
                "start_date": "07/12/2012",
                "end_date": "01/03/2022",
                "website": "https://www.meditech.com/",
                "description": "Pioneered application development initiatives with a focus on SDLC automation and cloud-based infrastructure, fostering a culture of innovation and continuous improvement among development teams.",
                "highlights": [
                    "Developed an efficiency-testing application, integrated a mail-server API, and enhanced search functionality within the Core project, boosting system performance and user satisfaction.",
                    "Supported and optimized web and desktop display libraries using MEDITECH's proprietary languages, enhancing application development efficiency and accessibility.",
                    "Architected and managed MEDITECH's inaugural Jenkins CI solution on Google Cloud Platform, significantly reducing Jenkins update risk and plugin management.",
                    "Managed over 100 company-wide biweekly deployments, ensuring smooth, error-free releases and minimal downtime.",
                    "Engineered and documented numerous features and bug fixes for Jira-SVN integration, automating routine tasks and increasing team productivity.",
                    "Directed the migration from Python 2 to Python 3, overseeing a team that refactored and enhanced codebase integrity and test coverage.",
                    "Led developer education initiatives, providing mentoring, workshops, and documentation that improved coding practices and software quality across the company.",
                    "Functioned as scrum master while devising software delivery roadmaps that aligned with strategic goals and accelerated project timelines."
                ]
            }
        ],
        "academics": [
            {
                "institution": "Ithaca College",
                "location": "Ithaca, New York",
                "website": "https://www.ithaca.edu/",
                "degree": "Bachelor of Music",
                "gpa": "3.7 (Magna cum Laude)"
            }
        ]
    }
}
